app/controllers/application_controller.rb

  def current_user
    @current_user ||= Chef.find(session[:chef_id]) if session[:chef_id]
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]