app/controllers/chefs_controller.rb

  def index
    @chefs = Chef.all
---
SELECT "chefs".* FROM "chefs"

  def show
    @chef = Chef.find(params[:id])
    @recipe = @chef.recipes.paginate(page: params[:page], per_page: 3)
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ? OFFSET ?  [["chef_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]

  def create
    @chef = Chef.new(chef_params)

    if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def edit
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]