app/controllers/chefs_controller.rb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_chef
      @chef = Chef.find(params[:id])