app/controllers/logins_controller.rb

  def create
    chef = Chef.find_by(email: params[:email])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."email" = ? LIMIT ?  [["email", "olooine@gmail.com"], ["LIMIT", 1]]