app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.paginate(page: params[:page], per_page: 3)
---
SELECT COUNT(*) FROM "recipes"
SELECT "recipes".* FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.find(1)

    if @recipe.save
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipes" ("name", "summary", "description", "created_at", "updated_at", "chef_id", "picture") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @recipe = Recipe.find(params[:id])

    if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Updated - Rails with"], ["updated_at", "2020-08-10 22:34:56.488578"], ["id", 3]]

  def like
    @recipe = Recipe.find(params[:id])

    like = Like.create(likes: params[:like], chef: Chef.first, recipe: @recipe)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "likes" ("likes", "chef_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["likes", 1], ["chef_id", 1], ["recipe_id", 1], ["created_at", "2020-08-18 19:38:24.879330"], ["updated_at", "2020-08-18 19:38:24.879330"]]
SELECT  "chefs".* FROM "chefs" ORDER BY "chefs"."id" ASC LIMIT ?  [["LIMIT", 1]]