app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_recipe
      @recipe = Recipe.find(params[:id])