app/models/recipe.rb

SELECT COUNT(*) FROM "likes" WHERE "likes"."recipe_id" = ? AND "likes"."likes" = ?  [["recipe_id", 4], ["likes", 1]]
---
  def thumbs_up_total
    self.likes.where(likes: true).size

SELECT COUNT(*) FROM "likes" WHERE "likes"."recipe_id" = ? AND "likes"."likes" = ?  [["recipe_id", 4], ["likes", 0]]
---
  def thumbs_down_total
    self.likes.where(likes: false).size